valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH6_OFF (22u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_AUX_IN_SRC_TIM_SEL_OUT_N_CH7_OFF (23u)

/** \brief Length for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_LEN (16u)

/** \brief Mask for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_OUT_TOM_Bits.TOM_OUT */
#define IFX_GTM_OUT_TOM_TOM_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_LEN (16u)

/** \brief Mask for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_OUT_TOM_Bits.TOM_OUT_N */
#define IFX_GTM_OUT_TOM_TOM_OUT_N_OFF (16u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_I_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_I_OUT_N_OFF (8u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_OFF (16u)

/** \brief Length for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_OUT_ATOM_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_OUT_ATOM_ATOM_IP1_OUT_N_OFF (24u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_OFF (0u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_OFF (2u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF (2u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF (4u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_OFF (6u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN (27u)

/** \brief Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK (0x7ffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_LEN (24u)

