valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_GTM_OCDS_OTBU0T_Bits.CV */
#define IFX_GTM_OCDS_OTBU0T_CV_LEN (27u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU0T_Bits.CV */
#define IFX_GTM_OCDS_OTBU0T_CV_MSK (0x7ffffffu)

/** \brief Offset for Ifx_GTM_OCDS_OTBU0T_Bits.CV */
#define IFX_GTM_OCDS_OTBU0T_CV_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTBU0T_Bits.CM */
#define IFX_GTM_OCDS_OTBU0T_CM_LEN (2u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU0T_Bits.CM */
#define IFX_GTM_OCDS_OTBU0T_CM_MSK (0x3u)

/** \brief Offset for Ifx_GTM_OCDS_OTBU0T_Bits.CM */
#define IFX_GTM_OCDS_OTBU0T_CM_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTBU1T_Bits.CV */
#define IFX_GTM_OCDS_OTBU1T_CV_LEN (24u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU1T_Bits.CV */
#define IFX_GTM_OCDS_OTBU1T_CV_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_OCDS_OTBU1T_Bits.CV */
#define IFX_GTM_OCDS_OTBU1T_CV_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTBU1T_Bits.EN */
#define IFX_GTM_OCDS_OTBU1T_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU1T_Bits.EN */
#define IFX_GTM_OCDS_OTBU1T_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OTBU1T_Bits.EN */
#define IFX_GTM_OCDS_OTBU1T_EN_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTBU2T_Bits.CV */
#define IFX_GTM_OCDS_OTBU2T_CV_LEN (24u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU2T_Bits.CV */
#define IFX_GTM_OCDS_OTBU2T_CV_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_OCDS_OTBU2T_Bits.CV */
#define IFX_GTM_OCDS_OTBU2T_CV_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_OFF (8u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_OFF (16u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_OFF (4u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_OFF (8u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_OFF (12u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_OFF (16u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_OFF (20u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_LEN (2u)

/** \brief Mask for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_MSK (0x3u)

