valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_OFF (0u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_OFF (4u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_OFF (8u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_OFF (12u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_OFF (16u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_OFF (20u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_OFF (24u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_OFF (28u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT0_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT0_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT0_SEL2_MSK (0xfu)

