valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_OFF (29u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_OFF (30u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_OFF (31u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_OFF (1u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_OFF (2u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_OFF (3u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_OFF (4u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_OFF (5u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_OFF (6u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_OFF (7u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_OFF (8u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_OFF (9u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_OFF (10u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_OFF (11u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_OFF (12u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_OFF (13u)

