valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_OFF (12u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_OFF (15u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_OFF (16u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_OFF (17u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_CTRL_UDMODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_CTRL_UDMODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_CTRL_UDMODE_OFF (18u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_OFF (20u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_OSM_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_OSM_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_OSM_TRIG_OFF (21u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_EXT_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_EXT_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_CTRL_EXT_TRIG_OFF (22u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_EXTTRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_EXTTRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_EXTTRIGOUT_OFF (23u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_OFF (24u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_OFF (25u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_OFF (26u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_OFF (27u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_CTRL_EXT_FUPD_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_CTRL_EXT_FUPD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_CTRL_EXT_FUPD_OFF (29u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SOMB */
#define IFX_GTM_ATOM_CH_CTRL_SOMB_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SOMB */
#define IFX_GTM_ATOM_CH_CTRL_SOMB_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SOMB */
#define IFX_GTM_ATOM_CH_CTRL_SOMB_OFF (30u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_CTRL_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_CTRL_FREEZE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_CTRL_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMB_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMB_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMB_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMB_TB12_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMB_TB12_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMB_TB12_SEL_OFF (2u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMB_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMB_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMB_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_1_0_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_1_0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_1_0_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_4_3_2_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_4_3_2_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMB_ACB_4_3_2_OFF (6u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMB_CMP_CTRL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMB_CMP_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMB_CMP_CTRL_OFF (9u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMB_EUPM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMB_EUPM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMB_EUPM_OFF (10u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMB_SL_LEN (1u)

